openfoam2/a2_circular_cylinder/meshB/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

forces
{
    type          forces;

    libs          ("libforces.so");

    writeControl  timeStep;
    timeInterval  1;

    log           yes;

    // specify the patches on which to compute forces
    patches       (cylinder);

    // moments
    CofR          (0 0 0);    // Centre of rotation for moment calculations 
    pitchAxis     (0 0 1);    // Pitch axis, z

    // do not change
    rho           rhoInf;     // Incompressible
    rhoInf        1.0;          // Incompressible

}


// ************************************************************************* //
